{"format": "graph-model", "generatedBy": "2.19.0", "convertedBy": "TensorFlow.js Converter v4.22.0", "signature": {"inputs": {"keras_tensor_340": {"name": "keras_tensor_340:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "6"}]}}}, "outputs": {"output_0": {"name": "Identity:0", "dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "-1"}, {"size": "4"}]}}}}, "modelTopology": {"node": [{"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Cast/x", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "12"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice/stack", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice/stack_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice/stack_2", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "3"}, {"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "3"}, {"size": "12"}, {"size": "1"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "12"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "12"}, {"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/concatenate_10_1/concat/axis", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims/dim", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "6"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/Squeeze", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/mul", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/sub", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "unknown_35", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "100"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape_1/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Add/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "2"}, {"size": "32"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape/shape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "3"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape_1", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "128"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/variance/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {"dim": [{"size": "1"}]}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/add/y", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/Reshape", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "1"}, {"size": "1"}, {"size": "64"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/global_average_pooling1d_10_1/Mean/reduction_indices", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_INT32", "tensorShape": {}}}, "dtype": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_32_1/Cast/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "64"}, {"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/dense_32_1/BiasAdd/ReadVariableOp", "op": "Const", "attr": {"value": {"tensor": {"dtype": "DT_FLOAT", "tensorShape": {"dim": [{"size": "4"}]}}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "keras_tensor_340", "op": "Placeholder", "attr": {"shape": {"shape": {"dim": [{"size": "-1"}, {"size": "100"}, {"size": "6"}]}}, "dtype": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice_1", "op": "StridedSlice", "input": ["keras_tensor_340", "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack", "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack_1", "StatefulPartitionedCall/functional_21_1/strided_slice_1/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "7"}, "end_mask": {"i": "3"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_21_1/strided_slice", "op": "StridedSlice", "input": ["keras_tensor_340", "StatefulPartitionedCall/functional_21_1/strided_slice/stack", "StatefulPartitionedCall/functional_21_1/strided_slice/stack_1", "StatefulPartitionedCall/functional_21_1/strided_slice/stack_2"], "attr": {"shrink_axis_mask": {"i": "0"}, "Index": {"type": "DT_INT32"}, "new_axis_mask": {"i": "0"}, "begin_mask": {"i": "3"}, "end_mask": {"i": "7"}, "T": {"type": "DT_FLOAT"}, "ellipsis_mask": {"i": "0"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/strided_slice_1", "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/strided_slice", "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "use_cudnn_on_gpu": {"b": true}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_50_1/convolution/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_52_1/convolution/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/re_lu_50_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_70_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/re_lu_52_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_73_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/re_lu_50_1/Relu", "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/re_lu_52_1/Relu", "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims", "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/ExpandDims_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/depthwise", "op": "DepthwiseConv2dNative", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims", "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/ExpandDims_1"], "attr": {"padding": {"s": "U0FNRQ=="}, "data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/depthwise"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_20_1/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/depthwise_conv1d_21_1/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/re_lu_51_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_71_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/re_lu_53_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_74_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/re_lu_51_1/Relu", "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/re_lu_53_1/Relu", "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution", "op": "Conv2D", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/ExpandDims_1"], "device": "/device:CPU:0", "attr": {"padding": {"s": "VkFMSUQ="}, "data_format": {"s": "TkhXQw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "use_cudnn_on_gpu": {"b": true}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/Squeeze", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_51_1/convolution/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_53_1/convolution/Squeeze", "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/add_20_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/strided_slice_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_72_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/add_21_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/strided_slice", "StatefulPartitionedCall/functional_21_1/batch_normalization_75_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/concatenate_10_1/concat", "op": "ConcatV2", "input": ["StatefulPartitionedCall/functional_21_1/add_20_1/Add", "StatefulPartitionedCall/functional_21_1/add_21_1/Add", "StatefulPartitionedCall/functional_21_1/concatenate_10_1/concat/axis"], "attr": {"N": {"i": "2"}, "Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims", "op": "ExpandDims", "input": ["StatefulPartitionedCall/functional_21_1/concatenate_10_1/concat", "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims/dim"], "attr": {"Tdim": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution", "op": "_FusedConv2D", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims", "StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution/ExpandDims_1", "StatefulPartitionedCall/functional_21_1/conv1d_54_1/Squeeze"], "device": "/device:CPU:0", "attr": {"num_host_args": {"i": "0"}, "data_format": {"s": "TkhXQw=="}, "filter_format": {"s": "SFdJTw=="}, "strides": {"list": {"i": ["1", "1", "1", "1"]}}, "num_args": {"i": "1"}, "fused_ops": {"list": {"s": ["Qmlhc0FkZA=="]}}, "TArgs": {"list": {"type": ["DT_FLOAT"]}}, "padding": {"s": "VkFMSUQ="}, "use_cudnn_on_gpu": {"b": true}, "leakyrelu_alpha": {"f": 0.2}, "epsilon": {"f": 0.0}, "T": {"type": "DT_FLOAT"}, "explicit_paddings": {"list": {}}, "dilations": {"list": {"i": ["1", "1", "1", "1"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/conv1d_54_1/BiasAdd", "op": "Squeeze", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_54_1/convolution"], "attr": {"T": {"type": "DT_FLOAT"}, "squeeze_dims": {"list": {"i": ["-3"]}}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/conv1d_54_1/BiasAdd", "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/mul_1", "StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/sub"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/re_lu_54_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/batch_normalization_76_1/batchnorm/add_1"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/sinusoidal_positional_embedding_10_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/re_lu_54_1/Relu", "unknown_35"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/sinusoidal_positional_embedding_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/sinusoidal_positional_embedding_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/sinusoidal_positional_embedding_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape_1", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape_1/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Reshape_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Reshape_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Reshape_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Add/ReadVariableOp"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/einsum/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/query_1/Add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/key_1/Add"], "attr": {"equation": {"s": "QlROSCxCU05ILT5CTlRT"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/einsum/Einsum", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Cast/x"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Softmax", "op": "Softmax", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/einsum_1/Einsum", "op": "Einsum", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/Softmax", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/value_1/Add"], "attr": {"equation": {"s": "Qk5UUyxCU05ILT5CVE5I"}, "N": {"i": "2"}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape", "op": "Reshape", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/einsum_1/Einsum", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape/shape"], "attr": {"T": {"type": "DT_FLOAT"}, "Tshape": {"type": "DT_INT32"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/Reshape_1"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/sinusoidal_positional_embedding_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/multi_head_attention_10_1/attention_output_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/add", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/moments/variance", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/add/y"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Rsqrt", "op": "Rsqrt", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/add"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Rsqrt", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Reshape"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul_1", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Neg", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul_2", "op": "Mul", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_2", "op": "AddN", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul_2", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/mul_1"], "attr": {"N": {"i": "2"}, "T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/ArithmeticOptimizer/AddOpsRewrite_add_2", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/Reshape_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/ArithmeticOptimizer/AddOpsRewrite_Leaf_1_add_2"], "attr": {"T": {"type": "DT_FLOAT"}, "_grappler_ArithmeticOptimizer_AddOpsRewriteStage": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/ArithmeticOptimizer/AddOpsRewrite_add_2", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/Cast/ReadVariableOp"], "attr": {"adj_x": {"b": false}, "grad_y": {"b": false}, "T": {"type": "DT_FLOAT"}, "adj_y": {"b": false}, "grad_x": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/Relu", "op": "Relu", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/MatMul", "op": "BatchMatMulV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_30_1/Relu", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/Cast/ReadVariableOp"], "attr": {"grad_y": {"b": false}, "adj_x": {"b": false}, "T": {"type": "DT_FLOAT"}, "grad_x": {"b": false}, "adj_y": {"b": false}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/BiasAdd", "op": "BiasAdd", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/MatMul", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/BiasAdd/ReadVariableOp"], "attr": {"data_format": {"s": "TkhXQw=="}, "T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add_1", "op": "AddV2", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_20_1/ArithmeticOptimizer/AddOpsRewrite_add_2", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/sequential_10_1/dense_31_1/BiasAdd"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/mean", "op": "Mean", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/mean/reduction_indices"], "attr": {"T": {"type": "DT_FLOAT"}, "Tidx": {"type": "DT_INT32"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/Neg", "op": "Neg", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/SquaredDifference", "op": "SquaredDifference", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/add_1", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/mean"], "attr": {"T": {"type": "DT_FLOAT"}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/variance", "op": "Mean", "input": ["StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/SquaredDifference", "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/moments/variance/reduction_indices"], "attr": {"Tidx": {"type": "DT_INT32"}, "T": {"type": "DT_FLOAT"}, "keep_dims": {"b": true}}}, {"name": "StatefulPartitionedCall/functional_21_1/transformer_encoder_block_10_1/layer_normalization_21_1/add", "op": "AddV2", "input": 